#+SEQ_TODO: TODAY TOMORROW TEST DONE
* TODAY What You Will Need
  CLOCK: [2015-11-24 মঙ্গল 09:52]--[2015-11-24 মঙ্গল 10:02] =>  0:10
  CLOCK: [2015-11-24 মঙ্গল 09:38]--[2015-11-24 মঙ্গল 09:50] =>  0:12
  :PROPERTIES:
  :Effort:   0:13
  :END:
** http://teropa.info/blog/2015/09/10/full-stack-redux-tutorial.html
** Install following packages 
*** DONE Node
    CLOSED: [2015-11-24 মঙ্গল 09:37]
#+BEGIN_SRC sh 
node -v 
#+END_SRC

#+RESULTS:
: v4.2.1
*** DONE ES6
*** React
*** Webpack
*** and Babel
** TOMORROW For good introduction we need to take a look at [[http://survivejs.com/][SurviveJS]]
* The App 
** We'll be developing an application for organizing live votes 
*** for parties, conferences, meetings, and other gatherings of people.
** For example, here's how a vote on the best Danny Boyle film
could go:
The app puts entries against each other in pairs, until a winner is found. 

** The app will have two separate user interfaces: The voting UI
can be used on a mobile device, or anything else that has a
web browser. The results UI is designed to be beamed on a
projector or some other large screen. It'll show the results
of the running vote in real time.

* The Architecture 
** The system will technically consist of two applications:
There's a browser app we'll make with React that provides
both the user interfaces, and a server app we'll make for
Node that handles the voting logic. Communication between the
two will be done using WebSockets.
** We're going to use Redux to organize the application code
both on the client and on the server. For holding the state
we'll use Immutable data structures.

** Even though there'll be a lot of similarity between the
client and server - both will use Redux, for example - this
isn't really a universal/isomorphic application and the two
won't actually share any code. 

* The Server Application 
** Description
***  We're going to write the Node application first and the React application after that. This will let us concentrate on the core logic before we start thinking about the UI.
*** As we create the server app, we'll get acquainted with Redux and Immutable, and will see how an application built with them holds together. Redux is most often associated with React applications, but it really isn't limited to that use case. Part of what we're going to learn is how useful Redux can be in other contexts as well!
** Designing The Application State Tree 
*** Designing a Redux app often begins by thinking about the application state data structure. This is what describes what's going on in your application at any given time.
*** All kinds of frameworks and architectures have state. 
**** In Ember apps and Backbone apps, state is in Models. 
**** In Angular apps, state is often in Factories and Services. 
**** In most Flux implementations, it is in Stores. 
**** How does Redux differ from these
***** The main difference is that in Redux.
***** the application state is all stored in one single tree structure. In other words, everything there is to know
about your application's state is stored in one data structure formed out
of maps and arrays.

** Project Setup
*** DONE This results in a directory with the single file "package.json" in it.
#+BEGIN_SRC sh
npm init -y
#+END_SRC
    
#+RESULTS:
*** DONE Install ES6, Mocha, Cha 
#+BEGIN_SRC sh
npm install --save-dev babel-core babel-cli babel-preset-es2015
npm install --save-dev mocha chai
#+END_SRC

#+RESULTS:
| babel-core@6.1.20          | node_modules/babel-core                                     |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | slash@1.0.0                                                 |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | shebang-regex@1.0.0                                         |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | path-exists@1.0.0                                           |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | path-is-absolute@1.0.0                                      |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-messages@6.1.18                                       |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-template@6.1.18                                       |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | private@0.1.6                                               |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-helpers@6.1.20                                        |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | esutils@2.0.2                                               |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | convert-source-map@1.1.2                                    |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | home-or-tmp@1.0.0                                           | (os-tmpdir@1.0.1,                            | user-home@1.1.1)                              |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | source-map@0.5.3                                            |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | debug@2.2.0                                                 | (ms@0.7.1)                                   |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babylon@6.1.20                                              |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-types@6.1.18                                          | (to-fast-properties@1.0.1)                   |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | minimatch@2.0.10                                            | (brace-expansion@1.1.1)                      |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-code-frame@6.1.18                                     | (js-tokens@1.0.2,                            | line-numbers@0.2.0,                           | chalk@1.1.1,                        | repeating@1.1.3)                   |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-generator@6.1.20                                      | (trim-right@1.0.1,                           | repeating@1.1.3,                              | is-integer@1.0.6,                   | detect-indent@3.0.1)               |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-traverse@6.1.20                                       | (globals@8.12.0,                             | repeating@1.1.3,                              | invariant@2.1.2)                    |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | source-map-support@0.2.10                                   | (source-map@0.1.32)                          |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | json5@0.4.0                                                 |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | regenerator@0.8.35                                          | (through@2.3.8,                              | esprima-fb@15001.1.0-dev-harmony-fb,          | recast@0.10.24,                     | commoner@0.10.4,                   | defs@1.1.1)            |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | lodash@3.10.1                                               |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-register@6.1.18                                       | (core-js@1.2.6)                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| └──                        | babel-runtime@5.8.34                                        | (core-js@1.2.6)                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
|                            |                                                             |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| babel-cli@6.1.18           | node_modules/babel-cli                                      |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | slash@1.0.0                                                 |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | path-exists@1.0.0                                           |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | fs-readdir-recursive@0.1.2                                  |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | path-is-absolute@1.0.0                                      |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | log-symbols@1.0.2                                           |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | convert-source-map@1.1.2                                    |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | v8flags@2.0.10                                              | (user-home@1.1.1)                            |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | commander@2.9.0                                             | (graceful-readlink@1.0.1)                    |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | source-map@0.5.3                                            |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | chalk@1.1.1                                                 | (escape-string-regexp@1.0.3,                 | supports-color@2.0.0,                         | ansi-styles@2.1.0,                  | has-ansi@2.0.0,                    | strip-ansi@3.0.0)      |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | glob@5.0.15                                                 | (inherits@2.0.1,                             | once@1.3.2,                                   | inflight@1.0.4,                     | minimatch@3.0.0)                   |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | output-file-sync@1.1.1                                      | (xtend@4.0.1,                                | mkdirp@0.5.1)                                 |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | request@2.65.0                                              | (aws-sign2@0.6.0,                            | forever-agent@0.6.1,                          | tunnel-agent@0.4.1,                 | oauth-sign@0.8.0,                  | caseless@0.11.0,       | stringstream@0.0.5,             | isstream@0.1.2,        | json-stringify-safe@5.0.1, | extend@3.0.0,         | tough-cookie@2.2.1, | qs@5.2.0, | node-uuid@1.4.6, | combined-stream@1.0.5, | mime-types@2.1.7, | form-data@1.0.0-rc3, | http-signature@0.11.0, | hawk@3.1.1, | bl@1.0.0, | har-validator@2.0.2) |
| ├──                        | chokidar@1.2.0                                              | (arrify@1.0.0,                               | glob-parent@2.0.0,                            | async-each@0.1.6,                   | is-glob@2.0.1,                     | is-binary-path@1.0.1,  | lodash.flatten@3.0.2,           | readdirp@2.0.0,        | anymatch@1.3.0)            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | bin-version-check@2.1.0                                     | (semver-truncate@1.0.0,                      | minimist@1.2.0,                               | semver@4.3.6,                       | bin-version@1.0.4)                 |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | lodash@3.10.1                                               |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-register@6.1.18                                       | (home-or-tmp@1.0.0,                          | source-map-support@0.2.10,                    | core-js@1.2.6)                      |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-polyfill@6.1.19                                       | (regenerator@0.8.42,                         | core-js@1.2.6)                                |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| └──                        | babel-runtime@5.8.34                                        | (core-js@1.2.6)                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
|                            |                                                             |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| babel-preset-es2015@6.1.18 | node_modules/babel-preset-es2015                            |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-plugin-transform-es2015-shorthand-properties@6.1.18   | (babel-types@6.1.18,                         | babel-runtime@5.8.34)                         |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-plugin-transform-es2015-arrow-functions@6.1.18        | (babel-runtime@5.8.34)                       |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-plugin-transform-es2015-template-literals@6.1.18      | (babel-runtime@5.8.34)                       |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-plugin-transform-es2015-literals@6.1.18               | (babel-runtime@5.8.34)                       |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-plugin-transform-es2015-block-scoped-functions@6.1.18 | (babel-runtime@5.8.34)                       |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-plugin-transform-es2015-typeof-symbol@6.1.18          | (babel-runtime@5.8.34)                       |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-plugin-transform-es2015-spread@6.1.18                 | (babel-runtime@5.8.34)                       |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-plugin-transform-es2015-destructuring@6.1.18          | (babel-runtime@5.8.34)                       |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-plugin-check-es2015-constants@6.1.18                  | (babel-runtime@5.8.34)                       |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-plugin-transform-es2015-for-of@6.1.18                 | (babel-runtime@5.8.34)                       |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-plugin-transform-es2015-block-scoping@6.1.18          | (babel-types@6.1.18,                         | babel-template@6.1.18,                        | babel-traverse@6.1.20,              | lodash@3.10.1,                     | babel-runtime@5.8.34)  |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-plugin-transform-es2015-function-name@6.1.18          | (babel-types@6.1.18,                         | babel-helper-function-name@6.1.18,            | babel-runtime@5.8.34)               |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-plugin-transform-es2015-object-super@6.1.18           | (babel-helper-replace-supers@6.1.18,         | babel-runtime@5.8.34)                         |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-plugin-transform-es2015-computed-properties@6.1.18    | (babel-template@6.1.18,                      | babel-helper-define-map@6.1.18,               | babel-runtime@5.8.34)               |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-plugin-transform-es2015-sticky-regex@6.1.18           | (babel-helper-regex@6.1.18,                  | babel-types@6.1.18,                           | babel-runtime@5.8.34)               |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-plugin-transform-es2015-unicode-regex@6.1.18          | (regexpu@1.3.0,                              | babel-helper-regex@6.1.18,                    | babel-runtime@5.8.34)               |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-plugin-transform-es2015-parameters@6.1.18             | (babel-helper-get-function-arity@6.1.18,     | babel-helper-call-delegate@6.1.18,            | babel-template@6.1.18,              | babel-types@6.1.18,                | babel-traverse@6.1.20, | babel-runtime@5.8.34)           |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-plugin-transform-es2015-modules-commonjs@6.1.20       | (babel-plugin-transform-strict-mode@6.1.18,  | babel-template@6.1.18,                        | babel-types@6.1.18,                 | babel-runtime@5.8.34)              |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | babel-plugin-transform-es2015-classes@6.1.20                | (babel-messages@6.1.18,                      | babel-helper-optimise-call-expression@6.1.18, | babel-helper-replace-supers@6.1.18, | babel-helper-function-name@6.1.18, | babel-template@6.1.18, | babel-helper-define-map@6.1.18, | babel-types@6.1.18,    | babel-traverse@6.1.20,     | babel-runtime@5.8.34) |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| └──                        | babel-plugin-transform-regenerator@6.1.18                   | (babel-plugin-syntax-async-functions@6.1.18, | private@0.1.6,                                | through@2.3.8,                      | babylon@6.1.20,                    | commoner@0.10.4,       | babel-types@6.1.18,             | babel-traverse@6.1.20, | babel-runtime@5.8.34)      |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| chai@3.4.1                 | node_modules/chai                                           |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | assertion-error@1.0.1                                       |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | type-detect@1.0.0                                           |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| └──                        | deep-eql@0.1.3                                              | (type-detect@0.1.1)                          |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
|                            |                                                             |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| mocha@2.3.3                | node_modules/mocha                                          |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | escape-string-regexp@1.0.2                                  |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | commander@2.3.0                                             |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | diff@1.4.0                                                  |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | supports-color@1.2.0                                        |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | growl@1.8.1                                                 |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | debug@2.0.0                                                 | (ms@0.6.2)                                   |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | mkdirp@0.5.0                                                | (minimist@0.0.8)                             |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| ├──                        | glob@3.2.3                                                  | (inherits@2.0.1,                             | graceful-fs@2.0.3,                            | minimatch@0.2.14)                   |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
| └──                        | jade@0.26.3                                                 | (commander@0.6.1,                            | mkdirp@0.3.0)                                 |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
|                            |                                                             |                                              |                                               |                                     |                                    |                        |                                 |                        |                            |                       |                     |           |                  |                        |                   |                      |                        |             |           |                      |
*** DONE tests with mocha command 
#+BEGIN_SRC sh
mkdir test
./node_modules/mocha/bin/mocha --compilers js:babel-core/register --recursive
#+END_SRC

#+RESULTS:
|                 |
|                 |
| 0 passing (3ms) |
*** DONE Place the command in package.json
package.json
"scripts": {
  "test": "mocha --compilers js:babel-core/register --recursive"
},
*** DONE Another thing we need to do is enable Babel's ES6/ES2015 language support. It's
done by activating the babel-preset-es2015 package that we already installed.
We just need to add a "babel" section to package.json:

package.json
"babel": {
  "presets": ["es2015"]
}
*** DONE test npm 
#+BEGIN_SRC sh
npm run test
#+END_SRC

#+RESULTS:
|   |                     |             |                                          |             |
| > | voting-server@1.0.0 | test        | /usr/local/src/jstutorials/voting-server |             |
| > | mocha               | --compilers | js:babel-core/register                   | --recursive |
|   |                     |             |                                          |             |
|   |                     |             |                                          |             |
|   |                     |             |                                          |             |
| 0 | passing             | (3ms)       |                                          |             |
|   |                     |             |                                          |             |

*** DONE Add immutability 
One of the first libraries we're going to be using is Facebook's Immutable,
which provides a number of data structures for us to use. We're going to start
discussing Immutable in the next section, but for now let's just add it to the
project, along with the chai-immutable library that extends Chai to add support
for comparing Immutable data structures:

#+BEGIN_SRC sh
npm install --save immutable
npm install --save-dev chai-immutable

#+END_SRC

#+RESULTS:
| immutable@3.7.5      | node_modules/immutable      |
| chai-immutable@1.5.2 | node_modules/chai-immutable |
*** We need to let plug in chai-immutable before any tests are run.
**** DONE Add test/test_helper.js
#+BEGIN_SRC js :tangle test/test_helper.js
import chai from 'chai';
import chaiImmutable from 'chai-immutable';

chai.use(chaiImmutable);

#+END_SRC
**** Modify package.json
"scripts": {
  "test": "mocha --compilers js:babel-core/register --require ./test/test_helper.js  --recursive",
  "test:watch": "npm run test -- --watch"
},

** Getting Comfortable With Immutable				  :IMMUTABLE:
   CLOCK: [2015-11-24 মঙ্গল 11:17]--[2015-11-24 মঙ্গল 12:44] =>  1:27
   :PROPERTIES:
   :Effort:   1:40
   :END:
The second important point about the Redux architecture is that the state is
not just a tree, but it is in fact an immutable tree.
*** The state is not just a tree, but it is in fact an immutable tree.
Looking at the trees in the previous section, it might at first seem like a
reasonable idea to have code that changes the state of the application by just
making updates in the tree: Replacing things in maps, removing things from
arrays, etc. However, this is not how things are done in Redux.
*** the next state is another state tree that reflects the current changes
A Redux application's state tree is an immutable data structure. That means
that once you have a state tree, it will never change as long as it exists. It
will keep holding the same state forever. How you then go to the next state is
by producing another state tree that reflects the changes you wanted to make.
*** Two successive states of the application are stored in two separate and independent trees. 
This means any two successive states of the application are stored in two
separate and independent trees. How you get from one to the next is by applying
a function that takes the current state and returns a new state.
*** How you get from one to the next is by applying a function that takes the current state and returns a new state.
*** Immutability Helpful for debuging
**** Can hold on to the history of your application
**** You can then do things like undo/redo for "free"
**** serialize the history
just setthe current application state to the previous or next tree in the history. 
You can also serialize the history and save it for later, or send it to some
storage so that you can replay it later, which can be hugely helpful when
debugging.
*** Data in, data out , pure function
However, I'd say that even beyond these extra features, the most important
thing about immutable data is how it simplifies your code. You get to program
with pure functions: 
**** pure functions: 
Functions that take data and return data and do nothing
else. These are functions that you can trust to behave predictably. You can
call them as many times as you like and their behavior won't change. Give them
the same arguments, and they'll return the same results. They're not going to
change the state of the world. Testing becomes trivial, as you don't need to
set up stubs or other fakes to "prepare the universe" before you call
something. It's just data in, data out.
*** Immutable data structures are the material we'll build our application's state
   CLOCK: [2015-11-24 মঙ্গল 12:35]--[2015-11-24 মঙ্গল 13:35] =>  1:00
Immutable data structures are the material we'll build our application's state
from, so let's spend some time getting comfortable with it by writing some unit
tests that illustrate how it all works.
*** Unit Testing Immutable Counter 
If you're already comfortable with immutable data and the Immutable library,
feel free to skip to the next section. 
**** To get acquainted with the idea of immutability
it may be helpful to first talk about the simplest possible data structure: What if you had a "counter"
application whose state was nothing but a single number? The state would go
from 0 to 1 to 2 to 3, etc.
**** We are already used to thinking of numbers as immutable data. 
     When the counter increments, we don't mutate a number. It would in fact be 
     impossible as there are no "setters" on numbers. You can't say 42.setValue(43).
**** What happens instead is we get another number
     Which is the result of adding 1 to the previous number. 
     That we can do with a pure function. Its argument is the current state and 
     its return value will be used as the next state. When it is called, 
     it does not change the current state. Here is such a function and a
     unit test for it:

#+BEGIN_SRC js :tangle test/immutable_spec.js
  import {expect} from 'chai'
  describe('a number', () => {
    function increment(currentState) {
      return currentState + 1;
    }
    it('is immutable', () => {
      let state = 42;
      let nextState = increment(state);
      expect(nextState).to.equal(43);
      expect(state).to.equal(42);
    });
  });
#+END_SRC

#+BEGIN_SRC sh :results verbatim drawer
npm run test
#+END_SRC

#+RESULTS:
:RESULTS:

> voting-server@1.0.0 test /usr/local/src/jstutorials/voting-server
> mocha --compilers js:babel-core/register --require ./test/test_helper.js --recursive



  immutability
    a number
      ✓ is immutable


  1 passing (55ms)

:END:

**** The fact that state doesn't change when increment is called should be obvious.
     How could it? Numbers are immutable!
**** You may have noticed that this test really has nothing to do with our
     application - we don't even have any application code yet! 
**** The test is just a learning tool for us. 
     I often find it useful to explore a new API or technique by writing unit tests 
     that exercise the relevant ideas, which is what we're doing here. Kent Beck calls 
     these kinds of tests "Learning Tests" in his original TDD book. 
     
     What we're going to do next is extend this same idea of immutability to all
     kinds of data structures, not just numbers.

**** Immutable's Lists 
     we can, for example, have an application whose state is
     a list of movies. An operation that adds a movie produces a new list that is
     the old list and the new movie combined. Crucially, the old state remains
     unchanged after the operation:
Head:     dad130b master immutable list tested
#+BEGIN_SRC js :tangle test/immutable_spec.js
imporot {expect} from 'chai';
import {List} from 'immutable';

describe('immutability', () => {
  describe('a number', () => {
    function increment(currentState) {
      return currentState + 1;
    }
    it('is immutable', () => {
      let state = 42;
      let nextState = increment(state);
      expect(nextState).to.equal(43);
      expect(state).to.equal(42);
    });
  });

  describe('A List', () => {
    function addMovie(currentState, movie){
      return currentState.push(movie);
    }

    it('is immutable', () => {
      let state = List.of('Trainspotting', '28 Days Later');
      let nextState = addMovie(state, 'Sunshine');

      expect(nextState).to.equal(List.of(
	'Trainspotting',
	'28 Days Later',
	'Sunshine'
      ));
      expect(state).to.equal(List.of(
	'Trainspotting',
	'28 Days Later'
      ));

    });
  });
});
#+END_SRC

#+BEGIN_SRC sh
npm run test
#+END_SRC

#+RESULTS:
 > voting-server@1.0.0  test  /usr/local/src/jstutorials/voting-server
 > mocha --compilers  js:babel-core/register --require ./test/test_helper.js --recursive 

|--------------+---------+--------+-----------|
| immutability |         |        |           |
| a            | number  |        |           |
|              | ✓       | is     | immutable |
| A            | List    |        |           |
|              | ✓       | is     | immutable |
|              |         |        |           |
|              |         |        |           |
| 2            | passing | (28ms) |           |
|              |         |        |           |

The old state would not have remained unchanged if we'd pushed into a regular
array! Since we're using an Immutable List instead, we have the same semantics
as we had with the number example.

The idea extends to full state trees as well. A state tree is just a nested
data structure of Lists, Maps, and possibly other kinds of collections.
Applying an operation to it involves producing a new state tree, leaving the
previous one untouched. If the state tree is a Map with a key 'movies' that
contains a List of movies, 
**** adding a movie means we need to create a new Map where the movies key points to a new List
#+BEGIN_SRC js :tangle test/immutable_spec.js
imporot {expect} from 'chai';
import {List, Map} from 'immutable';

describe('immutability', () => {
  describe('a number', () => {
    function increment(currentState) {
      return currentState + 1;
    }
    it('is immutable', () => {
      let state = 42;
      let nextState = increment(state);
      expect(nextState).to.equal(43);
      expect(state).to.equal(42);
    });
  });

  describe('A List', () => {
    function addMovie(currentState, movie){
      return currentState.push(movie);
    }

    it('is immutable', () => {
      let state = List.of('Trainspotting', '28 Days Later');
      let nextState = addMovie(state, 'Sunshine');

      expect(nextState).to.equal(List.of(
	'Trainspotting',
	'28 Days Later',
	'Sunshine'
      ));
      expect(state).to.equal(List.of(
	'Trainspotting',
	'28 Days Later'
      ));

    });
  });

  describe('a tree' , () => {
    function addMovie(currentState, movie ) {
      return currentState.set(
	'movies',
	currentState.get('movies').push(movie)
      );
    }

    it('is immatable', () => {
      let state = Map({
	movies: List.of('Trainspotting', '28 Days Later')
      });
      let nextState = addMovie(state, 'Sunshine');

      expect(nextState).to.equal(Map({
	movies: List.of(
	  'Trainspotting',
	  '28 Days Later',
	  'Sunshine'
	)
      }));
    });
  });
});
#+END_SRC

#+BEGIN_SRC sh
npm run test
#+END_SRC
Head:     19afc7b master new Map where the movies key points to a new List

#+RESULTS:
 > voting-server@1.0.0 test /usr/local/src/jstutorials/voting-server
 > mocha --compilers  js:babel-core/register  --require ./test/test_helper.js --recursive 

| immutability |         |        |           |  
| a	       | number	 |	  |	      |	 
|	       | ✓	 | is	  | immutable |	 
| A	       | List	 |	  |	      |	 
|	       | ✓	 | is	  | immutable |	 
| a	       | tree	 |	  |	      |	 
|	       | ✓	 | is	  | immatable |	 
|	       |	 |	  |	      |	 
|	       |	 |	  |	      |	 
| 3	       | passing | (30ms) |	      |	 
|	       |	 |	  |	      |	 

This is exactly the same behavior as before, just extended to show that it
works with nested data structures too. The same idea holds to all shapes and
sizes of data.

For operations on nested data structures such as this one, Immutable provides
several helper functions that make it easier to "reach into" the nested data to
produce an updated value. We can use one called update in this case to make the
code more concise:
#+BEGIN_SRC patch :tangle test/immutable_spec.js
-    function addMovie(currentState, movie ) {
-      return currentState.set(
-	'movies',
-	currentState.get('movies').push(movie)
-      );
+    function addMovie(currentState, movie) {
+      return currentState.update('movies', movies => movies.push(movie));
#+END_SRC

#+BEGIN_SRC sh
npm run test
#+END_SRC
Head:     b23ffbc master helper functions that make it easier to reach into
#+RESULTS:
| >  voting-server@1.0.0  test  /usr/local/src/jstutorials/voting-server     
| >  mocha  --compilers  js:babel-core/register  --require  ./test/test_helper.js  --recursive  

| immutability |         |        |           |
| a            | number  |        |           |
|              | ✓       | is     | immutable |
| A            | List    |        |           |
|              | ✓       | is     | immutable |
| a            | tree    |        |           |
|              | ✓       | is     | immatable |
|              |         |        |           |
|              |         |        |           |
| 3            | passing | (33ms) |           |
|              |         |        |           |
**** Reasons for using IMMUTABLE library
***** Immutable's data structures are designed from the ground up to be used
      immutably and thus provide an API that makes immutable operations convenient. 
***** I'm partial to Rich Hickey's view that there is no such as thing as
      immutability by convention. If you use data structures that allow mutations,
      sooner or later you or someone else is bound to make a mistake and mutate
      them. This is especially true when you're just getting started. Things like
      Object.freeze() may help with this. 
***** Immutable's data structures are persistent, meaning that they are internally
      structured so that producing new versions is efficient both in terms of time
      and memory, even for large state trees. Using plain objects and arrays may
      result in excessive amounts of copying, which hurts performance. 

** Writing The Application Logic With Pure Functions 
   CLOCK: [2015-11-24 মঙ্গল 10:02]--[2015-11-24 মঙ্গল 11:03] =>  1:01
   :PROPERTIES:
   :Effort:   0:54
   :ORDERED:  t
   :END:
Armed with an understanding of immutable state trees and the functions that
operate on them, we can turn our attention to the logic of our voting
application itself. The core of the app will be formed from the pieces that we
have been discussing: A tree structure and a set of functions that produce new
versions of that tree structure.

*** Loading Entries
**** Test Case for Entries and Source Code
     the application allows "loading in" a collection of entries that will be voted on. 
     We could have a function called setEntries that takes a previous state and 
     a collection of entries and produces a state where the entries are included. 
#+BEGIN_SRC js :tangle test/core_spec.js
import {List, Map} from 'immutable';
import {expect} from 'chai';
import {setEntries} from '../src/core';

describe('application logic', () => {
  describe('setEntries', () => {
    it('adds the entries to the state', ()=> {
      const state = Map();
      const entries = List.of('Trainspotting', '28 Days Later');
      const nextState = setEntries(state, entries);
      expect(nextState).to.equal(Map({
        entries: List.of('Trainspotting', '28 Days Later')
      }));
    });
  });
});

#+END_SRC

#+BEGIN_SRC js :tangle src/core.js
export function setEntries(state,entries){
  return state.set('entries', entries);
}
#+END_SRC

#+BEGIN_SRC sh :results verbatim 
npm run test 
#+END_SRC

#+RESULTS:
#+begin_example

> voting-server@1.0.0 test /usr/local/src/jstutorials/voting-server
> mocha --compilers js:babel-core/register --require ./test/test_helper.js --recursive



  application logic
    setEntries
      ✓ adds the entries to the state

  immutability
    a number
      ✓ is immutable
    A List
      ✓ is immutable
    a tree
      ✓ is immatable


  4 passing (105ms)

#+end_example
***** Array to Immutable List
#+BEGIN_SRC sh :results verbatim
npm run test
#+END_SRC 

#+RESULTS:
|              |                     |             |                                          |           |                       |             |       |
| >            | voting-server@1.0.0 | test        | /usr/local/src/jstutorials/voting-server |           |                       |             |       |
| >            | mocha               | --compilers | js:babel-core/register                   | --require | ./test/test_helper.js | --recursive |       |
|              |                     |             |                                          |           |                       |             |       |
|              |                     |             |                                          |           |                       |             |       |
|              |                     |             |                                          |           |                       |             |       |
| application  | logic               |             |                                          |           |                       |             |       |
| setEntries   |                     |             |                                          |           |                       |             |       |
|              | ✓                   | adds        | the                                      | entries   | to                    | the         | state |
|              |                     |             |                                          |           |                       |             |       |
| immutability |                     |             |                                          |           |                       |             |       |
| a            | number              |             |                                          |           |                       |             |       |
|              | ✓                   | is          | immutable                                |           |                       |             |       |
| A            | List                |             |                                          |           |                       |             |       |
|              | ✓                   | is          | immutable                                |           |                       |             |       |
| a            | tree                |             |                                          |           |                       |             |       |
|              | ✓                   | is          | immatable                                |           |                       |             |       |
|              |                     |             |                                          |           |                       |             |       |
|              |                     |             |                                          |           |                       |             |       |
| 4            | passing             | (36ms)      |                                          |           |                       |             |       |
|              |                     |             |                                          |           |                       |             |       |

*** Starting The Vote 
*** Voting 
*** Moving to The Next Pair 
*** Ending The Vote 

** Introducing Actions and Reducers 
** A Taste of Reducer Composition 
** Introducing The Redux Store 
** Setting Up a Socket.io Server 
** Broadcasting State from A Redux Listener 
** Receiving Remote Redux Actions 

* The Client Application 

** Client Project Setup 

*** Unit Testing support 

** React and react-hot-loader 
** Writing The UI for The Voting Screen 
** Immutable Data And Pure Rendering 
** Writing The UI for The Results Screen And Handling Routing 
** Introducing A Client-Side Redux Store 
** Getting Data In from Redux to React 
** Setting Up The Socket.io Client 
** Receiving Actions From The Server 
** Dispatching Actions From React Components 
** Sending Actions To The Server Using Redux Middleware 

* Exercises 

** 1. Invalid Vote Prevention 
** 2. Improved Vote State Reset 
** 3. Duplicate Vote Prevention 
** 4. Restarting The Vote 
** 5. Indicating Socket Connection State 
** Bonus Challenge: Going Peer to Peer 


#+RESULTS:
:RESULTS:

> voting-server@1.0.0 test /usr/local/src/jstutorials/voting-server
> ./node_modules/mocha/bin/mocha --compilers js:babel-core/register --require ./test/test_helper.js --recursive



  application logic
    setEntries
      ✓ adds the entries to the state

  a number
    ✓ is immutable


  2 passing (22ms)

:END:

*** Loading Entries 
*** Starting The Vote 
*** Voting 
*** Moving to The Next Pair 
*** Ending The Vote 

** Introducing Actions and Reducers 
** A Taste of Reducer Composition 
** Introducing The Redux Store 
** Setting Up a Socket.io Server 
** Broadcasting State from A Redux Listener 
** Receiving Remote Redux Actions 

* The Client Application 
** Client Project Setup 
*** Unit Testing support 
** React and react-hot-loader 
** Writing The UI for The Voting Screen 
** Immutable Data And Pure Rendering 
** Writing The UI for The Results Screen And Handling Routing 
** Introducing A Client-Side Redux Store 
** Getting Data In from Redux to React 
** Setting Up The Socket.io Client 
** Receiving Actions From The Server 
** Dispatching Actions From React Components 
** Sending Actions To The Server Using Redux Middleware 
* Exercises 
** 1. Invalid Vote Prevention 
** 2. Improved Vote State Reset 
** 3. Duplicate Vote Prevention 
** 4. Restarting The Vote 
** 5. Indicating Socket Connection State 
** Bonus Challenge: Going Peer to Peer 
 
